In [84]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [85]:
df=pd.read_csv('Social_Network_Ads.csv')

In [86]:
df.shape

(400, 5)

In [87]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [88]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [89]:
num_gender=pd.get_dummies(df['Gender'],drop_first=True)
num_gender

     Male
0       1
1       1
2       0
3       0
4       1
..    ...
395     0
396     1
397     0
398     1
399     0

[400 rows x 1 columns]

In [90]:
X=df.iloc[:,2:4]

In [91]:
X

     Age  EstimatedSalary
0     19            19000
1     35            20000
2     26            43000
3     27            57000
4     19            76000
..   ...              ...
395   46            41000
396   51            23000
397   50            20000
398   36            33000
399   49            36000

[400 rows x 2 columns]

In [92]:
pd.concat([X,num_gender],axis=1,ignore_index=True)

      0      1  2
0    19  19000  1
1    35  20000  1
2    26  43000  0
3    27  57000  0
4    19  76000  1
..   ..    ... ..
395  46  41000  0
396  51  23000  1
397  50  20000  0
398  36  33000  1
399  49  36000  0

[400 rows x 3 columns]

In [93]:
Y=df.iloc[:,4]

In [94]:
Y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

In [95]:
from sklearn.model_selection import train_test_split
X_train, X_test, Y_train, Y_test=train_test_split(X,Y,test_size=0.2)

In [96]:
from sklearn.preprocessing  import StandardScaler
std_scaler=StandardScaler()
std_scaler
df_std=pd.DataFrame(std_scaler.fit_transform(X_train),columns=X_train.columns)

In [97]:
from sklearn.neighbors import KNeighborsClassifier
knn = KNeighborsClassifier(n_neighbors=6)

In [98]:
knn.fit(X_train, Y_train)

KNeighborsClassifier(n_neighbors=6)

In [99]:
knn.score(X_test, Y_test)

0.725